# Data Exploration

Lets use a real life example to explore the useful data analysis features of pandas. For this purpose, we are going to use the Bike Shairing dataset that is made available on the UCI website. 
Using the various measures those are captured as part of this dataset, lets explore how pandas powerful capabilities can be utilized for the data wrangling and exploration.

Dataset and more information can be found at following URL - <br>
https://archive.ics.uci.edu/ml/datasets/Bike+Sharing+Dataset <br>
Please take some moments to go through the description of the dataset and its features which will be helpful for doing further data analysis.

The Basic Requirements
- Reading Data From CSV
- Formatting, cleaning and filtering Data Frames
- Group-by and Concat / Merge
- Writing Data to CSV

In [1]:
import pandas as pd
import numpy as np

# Step1 - Reading Data From CSV

As the data is stored in csv format, use read_csv function of pandas to read the data in pandas structure named DataFrame.

In [3]:
bikes = pd.read_csv("bike_shairing_hourly.csv")

<b> Data Viewing<b>

Lets explore the first and last few rows of dataframe.

In [5]:
bikes.head(2)

,instant,dteday,season,yr,mnth,hr,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,casual,registered,cnt
0,1,2011-01-01,1,0,1,0,0,6,0,1,0.24,0.2879,0.81,0.0,3,13,16
1,2,2011-01-01,1,0,1,1,0,6,0,1,0.22,0.2727,0.80,0.0,8,32,40

In [7]:
bikes.tail(2)

,instant,dteday,season,yr,mnth,hr,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,casual,registered,cnt
17377,17378,2012-12-31,1,1,12,22,0,1,1,1,0.26,0.2727,0.56,0.1343,13,48,61
17378,17379,2012-12-31,1,1,12,23,0,1,1,1,0.26,0.2727,0.65,0.1343,12,37,49

Lets find out number of rows and columns of data set.

In [9]:
bikes.shape

(17379, 17)

# Step 2 - Formatting, cleaning and filtering Data Frames

Lets check how many data values are present in each column.

In [11]:
bikes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17379 entries, 0 to 17378
Data columns (total 17 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   instant     17379 non-null  int64
 1   dteday      17379 non-null  object
 2   season      17379 non-null  int64
 3   yr          17379 non-null  int64
 4   mnth        17379 non-null  int64
 5   hr          17379 non-null  int64
 6   holiday     17379 non-null  int64
 7   weekday     17379 non-null  int64
 8   workingday  17379 non-null  int64
 9   weathersit  17379 non-null  int64
 10  temp        17379 non-null  float64
 11  atemp       17379 non-null  float64
 12  hum         17379 non-null  float64
 13  windspeed   17379 non-null  float64
 14  casual      17379 non-null  int64
 15  registered  17379 non-null  int64
 16  cnt         17379 non-null  int64
dtypes: float64(4), int64(12), object(1)
memory usage: 2.3+ MB

As all the features contains same number of data values, there are no missing values in dataset.

<b> Properties of data <b>

Lets check some properties of dataset :

In [15]:
bikes.columns

Index(['instant', 'dteday', 'season', 'yr', 'mnth', 'hr', 'holiday', 'weekday',
       'workingday', 'weathersit', 'temp', 'atemp', 'hum', 'windspeed',
       'casual', 'registered', 'cnt'],
      dtype='object')

18 features are present in dataset, most of which looks integers in nature.

In [17]:
bikes.dtypes

instant         int64
dteday         object
season          int64
yr              int64
mnth            int64
hr              int64
holiday         int64
weekday         int64
workingday      int64
weathersit      int64
temp          float64
atemp         float64
hum           float64
windspeed     float64
casual          int64
registered      int64
cnt             int64
dtype: object

dteday is datetime field so might need some transformation afterwards.

<b> Unique feature values <b>

Lets explore the unique values present in each feature. These unique values can give us some hints while doing grouping of the data.

In [19]:
bikes.dteday.unique() # two years dates stored from 1 Jan 2011 to 31 Dec 2012

array(['2011-01-01', '2011-01-02', '2011-01-03', '2011-01-04',
       '2011-01-05', '2011-01-06', '2011-01-07', '2011-01-08',
       '2011-01-09', '2011-01-10', '2011-01-11', '2011-01-12',
       '2011-01-13', '2011-01-14', '2011-01-15', '2011-01-16',
       '2011-01-17', '2011-01-18', '2011-01-19', '2011-01-20',
       '2011-01-21', '2011-01-22', '2011-01-23', '2011-01-24',
       '2011-01-25', '2011-01-26', '2011-01-27', '2011-01-28',
       '2011-01-29', '2011-01-30', '2011-01-31', '2011-02-01',
       '2011-02-02', '2011-02-03', '2011-02-04', '2011-02-05',
       '2011-02-06', '2011-02-07', '2011-02-08', '2011-02-09',
       '2011-02-10', '2011-02-11', '2011-02-12', '2011-02-13',
       '2011-02-14', '2011-02-15', '2011-02-16', '2011-02-17',
       '2011-02-18', '2011-02-19', '2011-02-20', '2011-02-21',
       '2011-02-22', '2011-02-23', '2011-02-24', '2011-02-25',
       '2011-02-26', '2011-02-27', '2011-02-28', '2011-03-01',
       '2011-03-02', '2011-03-03', '2011-03-04', '2011-03-05',
       '2011-03-06', '2011-03-07', '2011-03-08', '2011-03-09',
       '2011-03-10', '2011-03-11', '2011-03-12', '2011-03-13',
       '2011-03-14', '2011-03-15', '2011-03-16', '2011-03-17',
       '2011-03-18', '2011-03-19', '2011-03-20', '2011-03-21',
       '2011-03-22', '2011-03-23', '2011-03-24', '2011-03-25',
       '2011-03-26', '2011-03-27', '2011-03-28', '2011-03-29',
       '2011-03-30', '2011-03-31', '2011-04-01', '2011-04-02',
       '2011-04-03', '2011-04-04', '2011-04-05', '2011-04-06',
       '2011-04-07', '2011-04-08', '2011-04-09', '2011-04-10',
       '2011-04-11', '2011-04-12', '2011-04-13', '2011-04-14',
       '2011-04-15', '2011-04-16', '2011-04-17', '2011-04-18',
       '2011-04-19', '2011-04-20', '2011-04-21', '2011-04-22',
       '2011-04-23', '2011-04-24', '2011-04-25', '2011-04-26',
       '2011-04-27', '2011-04-28', '2011-04-29', '2011-04-30',
       '2011-05-01', '2011-05-02', '2011-05-03', '2011-05-04',
       '2011-05-05', '2011-05-06', '2011-05-07', '2011-05-08',
       '2011-05-09', '2011-05-10', '2011-05-11', '2011-05-12',
       '2011-05-13', '2011-05-14', '2011-05-15', '2011-05-16',
       '2011-05-17', '2011-05-18', '2011-05-19', '2011-05-20',
       '2011-05-21', '2011-05-22', '2011-05-23', '2011-05-24',
       '2011-05-25', '2011-05-26', '2011-05-27', '2011-05-28',
       '2011-05-29', '2011-05-30', '2011-05-31', '2011-06-01',
       '2011-06-02', '2011-06-03', '2011-06-04', '2011-06-05',
       '2011-06-06', '2011-06-07', '2011-06-08', '2011-06-09',
       '2011-06-10', '2011-06-11', '2011-06-12', '2011-06-13',
       '2011-06-14', '2011-06-15', '2011-06-16', '2011-06-17',
       '2011-06-18', '2011-06-19', '2011-06-20', '2011-06-21',
       '2011-06-22', '2011-06-23', '2011-06-24', '2011-06-25',
       '2011-06-26', '2011-06-27', '2011-06-28', '2011-06-29',
       '2011-06-30', '2011-07-01', '2011-07-02', '2011-07-03',
       '2011-07-04', '2011-07-05', '2011-07-06', '2011-07-07',
       '2011-07-08', '2011-07-09', '2011-07-10', '2011-07-11',
       '2011-07-12', '2011-07-13', '2011-07-14', '2011-07-15',
       '2011-07-16', '2011-07-17', '2011-07-18', '2011-07-19',
       '2011-07-20', '2011-07-21', '2011-07-22', '2011-07-23',
       '2011-07-24', '2011-07-25', '2011-07-26', '2011-07-27',
       '2011-07-28', '2011-07-29', '2011-07-30', '2011-07-31',
       '2011-08-01', '2011-08-02', '2011-08-03', '2011-08-04',
       '2011-08-05', '2011-08-06', '2011-08-07', '2011-08-08',
       '2011-08-09', '2011-08-10', '2011-08-11', '2011-08-12',
       '2011-08-13', '2011-08-14', '2011-08-15', '2011-08-16',
       '2011-08-17', '2011-08-18', '2011-08-19', '2011-08-20',
       '2011-08-21', '2011-08-22', '2011-08-23', '2011-08-24',
       '2011-08-25', '2011-08-26', '2011-08-27', '2011-08-28',
       '2011-08-29', '2011-08-30', '2011-08-31', '2011-09-01',
       '2011-09-02', '2011-09-03', '2011-09-04', '2011-09-05',
       '2011-09-06', '2011-09-07', '2011-09-08', '2011-09-09',
       '2011-09-10', '2011-09-11', '2011-09-12', '2011-09-13',
       '2011-09-14', '2011-09-15', '2011-09-16', '2011-09-17',
       '2011-09-18', '2011-09-19', '2011-09-20', '2011-09-21',
       '2011-09-22', '2011-09-23', '2011-09-24', '2011-09-25',
       '2011-09-26', '2011-09-27', '2011-09-28', '2011-09-29',
       '2011-09-30', '2011-10-01', '2011-10-02', '2011-10-03',
       '2011-10-04', '2011-10-05', '2011-10-06', '2011-10-07',
       '2011-10-08', '2011-10-09', '2011-10-10', '2011-10-11',
       '2011-10-12', '2011-10-13', '2011-10-14', '2011-10-15',
       '2011-10-16', '2011-10-17', '2011-10-18', '2011-10-19',
       '2011-10-20', '2011-10-21', '2011-10-22', '2011-10-23',
       '2011-10-24', '2011-10-25', '2011-10-26', '2011-10-27',
       '2011-10-28', '2011-10-29', '2011-10-30', '2011-10-31',
       '2011-11-01', '2011-11-02', '2011-11-03', '2011-11-04',
       '2011-11-05', '2011-11-06', '2011-11-07', '2011-11-08',
       '2011-11-09', '2011-11-10', '2011-11-11', '2011-11-12',
       '2011-11-13', '2011-11-14', '2011-11-15', '2011-11-16',
       '2011-11-17', '2011-11-18', '2011-11-19', '2011-11-20',
       '2011-11-21', '2011-11-22', '2011-11-23', '2011-11-24',
       '2011-11-25', '2011-11-26', '2011-11-27', '2011-11-28',
       '2011-11-29', '2011-11-30', '2011-12-01', '2011-12-02',
       '2011-12-03', '2011-12-04', '2011-12-05', '2011-12-06',
       '2011-12-07', '2011-12-08', '2011-12-09', '2011-12-10',
       '2011-12-11', '2011-12-12', '2011-12-13', '2011-12-14',
       '2011-12-15', '2011-12-16', '2011-12-17', '2011-12-18',
       '2011-12-19', '2011-12-20', '2011-12-21', '2011-12-22',
       '2011-12-23', '2011-12-24', '2011-12-25', '2011-12-26',
       '2011-12-27', '2011-12-28', '2011-12-29', '2011-12-30',
       '2011-12-31', '2012-01-01', '2012-01-02', '2012-01-03',
       '2012-01-04', '2012-01-05', '2012-01-06', '2012-01-07',
       '2012-01-08', '2012-01-09', '2012-01-10', '2012-01-11',
       '2012-01-12', '2012-01-13', '2012-01-14', '2012-01-15',
       '2012-01-16', '2012-01-17', '2012-01-18', '2012-01-19',
       '2012-01-20', '2012-01-21', '2012-01-22', '2012-01-23',
       '2012-01-24', '2012-01-25', '2012-01-26', '2012-01-27',
       '2012-01-28', '2012-01-29', '2012-01-30', '2012-01-31',
       '2012-02-01', '2012-02-02', '2012-02-03', '2012-02-04',
       '2012-02-05', '2012-02-06', '2012-02-07', '2012-02-08',
       '2012-02-09', '2012-02-10', '2012-02-11', '2012-02-12',
       '2012-02-13', '2012-02-14', '2012-02-15', '2012-02-16',
       '2012-02-17', '2012-02-18', '2012-02-19', '2012-02-20',
       '2012-02-21', '2012-02-22', '2012-02-23', '2012-02-24',
       '2012-02-25', '2012-02-26', '2012-02-27', '2012-02-28',
       '2012-02-29', '2012-03-01', '2012-03-02', '2012-03-03',
       '2012-03-04', '2012-03-05', '2012-03-06', '2012-03-07',
       '2012-03-08', '2012-03-09', '2012-03-10', '2012-03-11',
       '2012-03-12', '2012-03-13', '2012-03-14', '2012-03-15',
       '2012-03-16', '2012-03-17', '2012-03-18', '2012-03-19',
       '2012-03-20', '2012-03-21', '2012-03-22', '2012-03-23',
       '2012-03-24', '2012-03-25', '2012-03-26', '2012-03-27',
       '2012-03-28', '2012-03-29', '2012-03-30', '2012-03-31',
       '2012-04-01', '2012-04-02', '2012-04-03', '2012-04-04',
       '2012-04-05', '2012-04-06', '2012-04-07', '2012-04-08',
       '2012-04-09', '2012-04-10', '2012-04-11', '2012-04-12',
       '2012-04-13', '2012-04-14', '2012-04-15', '2012-04-16',
       '2012-04-17', '2012-04-18', '2012-04-19', '2012-04-20',
       '2012-04-21', '2012-04-22', '2012-04-23', '2012-04-24',
       '2012-04-25', '2012-04-26', '2012-04-27', '2012-04-28',
       '2012-04-29', '2012-04-30', '2012-05-01', '2012-05-02',
       '2012-05-03', '2012-05-04', '2012-05-05', '2012-05-06',
       '2012-05-07', '2012-05-08', '2012-05-09', '2012-05-10',
       '2012-05-11', '2012-05-12', '2012-05-13', '2012-05-14',
       '2012-05-15', '2012-05-16', '2012-05-17', '2012-05-18',
       '2012-05-19', '2012-05-20', '2012-05-21', '2012-05-22',
       '2012-05-23', '2012-05-24', '2012-05-25', '2012-05-26',
       '2012-05-27', '2012-05-28', '2012-05-29', '2012-05-30',
       '2012-05-31', '2012-06-01', '2012-06-02', '2012-06-03',
       '2012-06-04', '2012-06-05', '2012-06-06', '2012-06-07',
       '2012-06-08', '2012-06-09', '2012-06-10', '2012-06-11',
       '2012-06-12', '2012-06-13', '2012-06-14', '2012-06-15',
       '2012-06-16', '2012-06-17', '2012-06-18', '2012-06-19',
       '2012-06-20', '2012-06-21', '2012-06-22', '2012-06-23',
       '2012-06-24', '2012-06-25', '2012-06-26', '2012-06-27',
       '2012-06-28', '2012-06-29', '2012-06-30', '2012-07-01',
       '2012-07-02', '2012-07-03', '2012-07-04', '2012-07-05',
       '2012-07-06', '2012-07-07', '2012-07-08', '2012-07-09',
       '2012-07-10', '2012-07-11', '2012-07-12', '2012-07-13',
       '2012-07-14', '2012-07-15', '2012-07-16', '2012-07-17',
       '2012-07-18', '2012-07-19', '2012-07-20', '2012-07-21',
       '2012-07-22', '2012-07-23', '2012-07-24', '2012-07-25',
       '2012-07-26', '2012-07-27', '2012-07-28', '2012-07-29',
       '2012-07-30', '2012-07-31', '2012-08-01', '2012-08-02',
       '2012-08-03', '2012-08-04', '2012-08-05', '2012-08-06',
       '2012-08-07', '2012-08-08', '2012-08-09', '2012-08-10',
       '2012-08-11', '2012-08-12', '2012-08-13', '2012-08-14',
       '2012-08-15', '2012-08-16', '2012-08-17', '2012-08-18',
       '2012-08-19', '2012-08-20', '2012-08-21', '2012-08-22',
       '2012-08-23', '2012-08-24', '2012-08-25', '2012-08-26',
       '2012-08-27', '2012-08-28', '2012-08-29', '2012-08-30',
       '2012-08-31', '2012-09-01', '2012-09-02', '2012-09-03',
       '2012-09-04', '2012-09-05', '2012-09-06', '2012-09-07',
       '2012-09-08', '2012-09-09', '2012-09-10', '2012-09-11',
       '2012-09-12', '2012-09-13', '2012-09-14', '2012-09-15',
       '2012-09-16', '2012-09-17', '2012-09-18', '2012-09-19',
       '2012-09-20', '2012-09-21', '2012-09-22', '2012-09-23',
       '2012-09-24', '2012-09-25', '2012-09-26', '2012-09-27',
       '2012-09-28', '2012-09-29', '2012-09-30', '2012-10-01',
       '2012-10-02', '2012-10-03', '2012-10-04', '2012-10-05',
       '2012-10-06', '2012-10-07', '2012-10-08', '2012-10-09',
       '2012-10-10', '2012-10-11', '2012-10-12', '2012-10-13',
       '2012-10-14', '2012-10-15', '2012-10-16', '2012-10-17',
       '2012-10-18', '2012-10-19', '2012-10-20', '2012-10-21',
       '2012-10-22', '2012-10-23', '2012-10-24', '2012-10-25',
       '2012-10-26', '2012-10-27', '2012-10-28', '2012-10-29',
       '2012-10-30', '2012-10-31', '2012-11-01', '2012-11-02',
       '2012-11-03', '2012-11-04', '2012-11-05', '2012-11-06',
       '2012-11-07', '2012-11-08', '2012-11-09', '2012-11-10',
       '2012-11-11', '2012-11-12', '2012-11-13', '2012-11-14',
       '2012-11-15', '2012-11-16', '2012-11-17', '2012-11-18',
       '2012-11-19', '2012-11-20', '2012-11-21', '2012-11-22',
       '2012-11-23', '2012-11-24', '2012-11-25', '2012-11-26',
       '2012-11-27', '2012-11-28', '2012-11-29', '2012-11-30',
       '2012-12-01', '2012-12-02', '2012-12-03', '2012-12-04',
       '2012-12-05', '2012-12-06', '2012-12-07', '2012-12-08',
       '2012-12-09', '2012-12-10', '2012-12-11', '2012-12-12',
       '2012-12-13', '2012-12-14', '2012-12-15', '2012-12-16',
       '2012-12-17', '2012-12-18', '2012-12-19', '2012-12-20',
       '2012-12-21', '2012-12-22', '2012-12-23', '2012-12-24',
       '2012-12-25', '2012-12-26', '2012-12-27', '2012-12-28',
       '2012-12-29', '2012-12-30', '2012-12-31'], dtype=object)

In [21]:
bikes.season.unique()  # four seasons

array([1, 2, 3, 4], dtype=int64)

Same thing can be done using [] operator

In [23]:
bikes["season"].unique()  # four seasons

array([1, 2, 3, 4], dtype=int64)

In [25]:
bikes.yr.unique() # two values - 0 for year 2011 and 1 for year 2012

array([0, 1], dtype=int64)

In [27]:
bikes.mnth.unique() # 12 months data stored

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12], dtype=int64)

In [29]:
bikes.hr.unique()  # for each day of month, 24 hours data stored

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
       17, 18, 19, 20, 21, 22, 23], dtype=int64)

In [31]:
bikes.holiday.unique() #0- no holidy , 1 holiday

array([0, 1], dtype=int64)

In [33]:
bikes.weekday.unique() # each weekday given a number

array([6, 0, 1, 2, 3, 4, 5], dtype=int64)

In [35]:
bikes.workingday.unique()  # workingday 1 otherwise 0

array([0, 1], dtype=int64)

In [39]:
bikes.weathersit.unique() #weathersit  has four values - 1 , 2, 3, 4

array([1, 2, 3, 4], dtype=int64)

temp, atemp, hum, windspeed are real numbers so will not interested in unique values for it.

casual, registered and cnt are aggregated user counts for each day, so will not be interested in unique values for it.

<b> Missing values identification <b>

Missing values, null values, NaN needs to be identified.

In [43]:
bikes.isnull().sum()

instant       0
dteday        0
season        0
yr            0
mnth          0
hr            0
holiday       0
weekday       0
workingday    0
weathersit    0
temp          0
atemp         0
hum           0
windspeed     0
casual        0
registered    0
cnt           0
dtype: int64

In [45]:
bikes.isna().sum()

instant       0
dteday        0
season        0
yr            0
mnth          0
hr            0
holiday       0
weekday       0
workingday    0
weathersit    0
temp          0
atemp         0
hum           0
windspeed     0
casual        0
registered    0
cnt           0
dtype: int64

Individual column can also be chcked for the null values.

In [47]:
bikes.dteday.isnull().sum()

0

None of the feature contains missing values or NaN.

If null values are present in the dataframe, following code needs to be executed in order to get rid of them.

In [49]:
bikes = bikes.dropna()
#or inplace replacment in data frame
bikes.dropna(inplace=True)
bikes.count()

instant       17379
dteday        17379
season        17379
yr            17379
mnth          17379
hr            17379
holiday       17379
weekday       17379
workingday    17379
weathersit    17379
temp          17379
atemp         17379
hum           17379
windspeed     17379
casual        17379
registered    17379
cnt           17379
dtype: int64

Null values can be removed from individual columns as well.

In [51]:
bikes.yr.dropna(inplace=True)
bikes.yr.count()

17379

Or missing values can be imputed with some other default values.

In [53]:
bikes.mnth.fillna(0)  #Replace nulls with 0
bikes.mnth.unique()

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12], dtype=int64)

<b> Duplicate records identification<b>

Duplicate records needs to be identified and removed.

In [55]:
bikes.duplicated().sum()

0

There are no duplicate records in the data frame.  Same duplicate check can be done on a column as well.

In [57]:
bikes.instant.duplicated().sum()

0

If duplicate records are present, then following code can be used to remove them.

In [59]:
bikes.drop_duplicates(subset="instant", keep="first", inplace=True)
bikes.count()

instant       17379
dteday        17379
season        17379
yr            17379
mnth          17379
hr            17379
holiday       17379
weekday       17379
workingday    17379
weathersit    17379
temp          17379
atemp         17379
hum           17379
windspeed     17379
casual        17379
registered    17379
cnt           17379
dtype: int64

<b> Data transformation <b>

The datetime column "dte" is captured as object but as it contains date time in it, a lot of interesting things can be dervied from it and added to the existing data frame for further analysis.

In [61]:
bikes.dteday.head()

0    2011-01-01
1    2011-01-01
2    2011-01-01
3    2011-01-01
4    2011-01-01
Name: dteday, dtype: object

Lets convert "dteday" to datetime.

In [63]:
dte = pd.to_datetime(bikes.dteday)
type(dte)

pandas.core.series.Series

In [73]:
bikes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17379 entries, 0 to 17378
Data columns (total 18 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   instant     17379 non-null  int64
 1   dteday      17379 non-null  object
 2   season      17379 non-null  int64
 3   yr          17379 non-null  int64
 4   mnth        17379 non-null  int64
 5   hr          17379 non-null  int64
 6   holiday     17379 non-null  int64
 7   weekday     17379 non-null  int64
 8   workingday  17379 non-null  int64
 9   weathersit  17379 non-null  int64
 10  temp        17379 non-null  float64
 11  atemp       17379 non-null  float64
 12  hum         17379 non-null  float64
 13  windspeed   17379 non-null  float64
 14  casual      17379 non-null  int64
 15  registered  17379 non-null  int64
 16  cnt         17379 non-null  int64
 17  year        17379 non-null  int32
dtypes: float64(4), int32(1), int64(12), object(1)
memory usage: 2.3+ MB

<b> Feature Extraction<b>

Now extract year, month and day from "dte" series.

In [67]:
year = dte.dt.year
print(year.head(2))
print(year.tail(2))

0    2011
1    2011
Name: dteday, dtype: int32
17377    2012
17378    2012
Name: dteday, dtype: int32

Add year series into the data frame.

In [69]:
bikes["year"] = year
bikes.year.count()

17379

Same way month, day , weekday features can be extracted from it and added to the dataframe. But our data frame already contains that information so we will not bother about it.

In [ ]:
months = dte.dt.month
days = dte.dt.day
day_of_weeks = dte.dt.dayofweek
day_of_year = dte.dt.dayofyear
weekdays = dte.dt.weekday
week_of_year = dte.dt.weekofyear

<b>Feature Reduction <b>

Some of the features like "instant" does not do any value addition for the analysis apart from identifying the unique record. But same thing can be induced from the row label, hence the "instant" feature can be removed.

In [75]:
bikes.drop(["instant"], axis=1, inplace=True)
bikes.columns

Index(['dteday', 'season', 'yr', 'mnth', 'hr', 'holiday', 'weekday',
       'workingday', 'weathersit', 'temp', 'atemp', 'hum', 'windspeed',
       'casual', 'registered', 'cnt', 'year'],
      dtype='object')

Similary, "cnt" attribute can be derived from "casual" and "registered" attributes. So "cnt" is redundant information, hence can be removed.

In [77]:
bikes.drop(["cnt"], axis=1, inplace=True)
bikes.columns

Index(['dteday', 'season', 'yr', 'mnth', 'hr', 'holiday', 'weekday',
       'workingday', 'weathersit', 'temp', 'atemp', 'hum', 'windspeed',
       'casual', 'registered', 'year'],
      dtype='object')

In [79]:
bikes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17379 entries, 0 to 17378
Data columns (total 16 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   dteday      17379 non-null  object
 1   season      17379 non-null  int64
 2   yr          17379 non-null  int64
 3   mnth        17379 non-null  int64
 4   hr          17379 non-null  int64
 5   holiday     17379 non-null  int64
 6   weekday     17379 non-null  int64
 7   workingday  17379 non-null  int64
 8   weathersit  17379 non-null  int64
 9   temp        17379 non-null  float64
 10  atemp       17379 non-null  float64
 11  hum         17379 non-null  float64
 12  windspeed   17379 non-null  float64
 13  casual      17379 non-null  int64
 14  registered  17379 non-null  int64
 15  year        17379 non-null  int32
dtypes: float64(4), int32(1), int64(10), object(1)
memory usage: 2.1+ MB

<b> Filtering<b>

Lets divide the data frame into two different data frames each one containing different year.

In [81]:
bikes_2011 = bikes[bikes.year == 2011]
bikes_2011.head(2)

,dteday,season,yr,mnth,hr,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,casual,registered,year
0,2011-01-01,1,0,1,0,0,6,0,1,0.24,0.2879,0.81,0.0,3,13,2011
1,2011-01-01,1,0,1,1,0,6,0,1,0.22,0.2727,0.80,0.0,8,32,2011

In [83]:
bikes_2012 = bikes[bikes.year == 2012]
bikes_2012.head(2)

,dteday,season,yr,mnth,hr,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,casual,registered,year
8645,2012-01-01,1,1,1,0,0,0,0,1,0.36,0.3788,0.66,0.0000,5,43,2012
8646,2012-01-01,1,1,1,1,0,0,0,1,0.36,0.3485,0.66,0.1343,15,78,2012

Similary several smaller data frames can be derived out of complete data set and then anlysis can be done on those data frames.

In [85]:
bikes_2011_summer = bikes[(bikes.year == 2011) & (bikes.season == 2)]
bikes_2011_summer.head(2)

,dteday,season,yr,mnth,hr,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,casual,registered,year
1807,2011-03-21,2,0,3,0,0,1,1,3,0.34,0.303,0.66,0.3881,2,11,2011
1808,2011-03-21,2,0,3,1,0,1,1,2,0.34,0.303,0.71,0.3881,1,6,2011

In [87]:
bikes_holiday = bikes[bikes.holiday == 1]
bikes_holiday.head(2)

,dteday,season,yr,mnth,hr,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,casual,registered,year
372,2011-01-17,1,0,1,0,1,1,0,2,0.2,0.197,0.47,0.2239,1,16,2011
373,2011-01-17,1,0,1,1,1,1,0,2,0.2,0.197,0.44,0.1940,1,15,2011

<b> Quick stat about numeric features<b>

Lets look at the quick statistics about this dataset.

In [89]:
bikes.describe()

,season,yr,mnth,hr,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,casual,registered,year
count,17379.000000,17379.000000,17379.000000,17379.000000,17379.000000,17379.000000,17379.000000,17379.000000,17379.000000,17379.000000,17379.000000,17379.000000,17379.000000,17379.000000,17379.000000
mean,2.501640,0.502561,6.537775,11.546752,0.028770,3.003683,0.682721,1.425283,0.496987,0.475775,0.627229,0.190098,35.676218,153.786869,2011.502561
std,1.106918,0.500008,3.438776,6.914405,0.167165,2.005771,0.465431,0.639357,0.192556,0.171850,0.192930,0.122340,49.305030,151.357286,0.500008
min,1.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,1.000000,0.020000,0.000000,0.000000,0.000000,0.000000,0.000000,2011.000000
25%,2.000000,0.000000,4.000000,6.000000,0.000000,1.000000,0.000000,1.000000,0.340000,0.333300,0.480000,0.104500,4.000000,34.000000,2011.000000
50%,3.000000,1.000000,7.000000,12.000000,0.000000,3.000000,1.000000,1.000000,0.500000,0.484800,0.630000,0.194000,17.000000,115.000000,2012.000000
75%,3.000000,1.000000,10.000000,18.000000,0.000000,5.000000,1.000000,2.000000,0.660000,0.621200,0.780000,0.253700,48.000000,220.000000,2012.000000
max,4.000000,1.000000,12.000000,23.000000,1.000000,6.000000,1.000000,4.000000,1.000000,1.000000,1.000000,0.850700,367.000000,886.000000,2012.000000

Lets look at users statistics :

In [91]:
bikes.casual.describe()  #casual users stat

count    17379.000000
mean        35.676218
std         49.305030
min          0.000000
25%          4.000000
50%         17.000000
75%         48.000000
max        367.000000
Name: casual, dtype: float64

In [93]:
bikes.registered.describe()  #registered users stat

count    17379.000000
mean       153.786869
std        151.357286
min          0.000000
25%         34.000000
50%        115.000000
75%        220.000000
max        886.000000
Name: registered, dtype: float64

# Step3 - Group-by and Concat /Merge

<b> Group by based on single feature<b>

There are four seasons for which bike shairing data is collected. Lets figure out how many users are using this service as per different seasons.

In [95]:
#First create the group by 
df_by_seasons = bikes.groupby("season")
type(df_by_seasons)

pandas.core.groupby.generic.DataFrameGroupBy

In [103]:
df_by_seasons

In [105]:
#sum("casual") group by season
df_by_seasons["casual"].sum()

season
1     60622
2    203522
3    226091
4    129782
Name: casual, dtype: int64

In [107]:
#sum("registered") group by season
df_by_seasons["registered"].sum()

season
1    410726
2    715067
3    835038
4    711831
Name: registered, dtype: int64

In [109]:
#sum("registered") group by season , sort in ascending order
df_by_seasons["registered"].sum().sort_values()

season
1    410726
4    711831
2    715067
3    835038
Name: registered, dtype: int64

In [111]:
#sum("registered") group by season , sort in descending order
df_by_seasons["registered"].sum().sort_values(ascending=False)

season
3    835038
2    715067
4    711831
1    410726
Name: registered, dtype: int64

Combine the outcome of two group by into single data frame.

In [114]:
#Create the summarized data for casual users
df_casual = df_by_seasons["casual"].sum()
df_casual

season
1     60622
2    203522
3    226091
4    129782
Name: casual, dtype: int64

In [116]:
#Create the summarized data for registered users
df_registered = df_by_seasons["registered"].sum()
df_registered

season
1    410726
2    715067
3    835038
4    711831
Name: registered, dtype: int64

In [126]:
#Combine the two frames into single one using pandas concat feature
frames = [df_casual, df_registered]
df_seasons = pd.concat(frames, axis=1)
df_seasons

        casual  registered
season
1        60622      410726
2       203522      715067
3       226091      835038
4       129782      711831

In [130]:
#Add the rowwise total for each season
df_seasons["total"] = df_seasons["casual"] + df_seasons["registered"]
df_seasons

        casual  registered    total
season
1        60622      410726   471348
2       203522      715067   918589
3       226091      835038  1061129
4       129782      711831   841613

<b> Group by based on multiple features<b>

Lets explore how more than one attributes can be used in group by clause. Average number of users for different years and months can be found as follows :

In [132]:
#Create the group by based on year and months
df_by_year_months = bikes.groupby(["year", "mnth"])

In [134]:
#Compute the average number of casual users per month per year
series_casual = df_by_year_months["casual"].mean()
series_casual

year  mnth
2011  1        4.466570
      2        9.617874
      3       17.569863
      4       31.079277
      5       41.733871
      6       42.516667
      7       48.994624
      8       39.455540
      9       37.022315
      10      33.946164
      11      21.688456
      12      11.400810
2012  1       12.103914
      2       12.602601
      3       42.554509
      4       53.559889
      5       59.455645
      6       60.130556
      7       56.055108
      8       58.060484
      9       60.802778
      10      48.782486
      11      29.260446
      12      17.850404
Name: casual, dtype: float64

In [136]:
#Compute the average number of registered users per month per year
series_registered = df_by_year_months["registered"].mean()
series_registered

year  mnth
2011  1        51.040698
      2        64.673344
      3        70.163014
      4       100.867872
      5       140.821237
      6       156.805556
      7       140.979839
      8       147.536252
      9       140.687587
      10      132.286676
      11      120.407510
      12      106.443995
2012  1       118.454791
      2       136.439306
      3       179.349933
      4       189.091922
      5       203.803763
      6       221.577778
      7       217.610215
      8       230.250000
      9       242.770833
      10      232.066384
      11      183.363510
      12      148.878706
Name: registered, dtype: float64

In [138]:
#Concatenate the results of two data frames
df_casual = pd.DataFrame(series_casual)
#df_casual
df_registered = pd.DataFrame(series_registered)
#df_registered
df_year_month = pd.merge(df_casual,df_registered, on=['year', 'mnth'])
df_year_month

              casual  registered
year mnth
2011 1      4.466570   51.040698
     2      9.617874   64.673344
     3     17.569863   70.163014
     4     31.079277  100.867872
     5     41.733871  140.821237
     6     42.516667  156.805556
     7     48.994624  140.979839
     8     39.455540  147.536252
     9     37.022315  140.687587
     10    33.946164  132.286676
     11    21.688456  120.407510
     12    11.400810  106.443995
2012 1     12.103914  118.454791
     2     12.602601  136.439306
     3     42.554509  179.349933
     4     53.559889  189.091922
     5     59.455645  203.803763
     6     60.130556  221.577778
     7     56.055108  217.610215
     8     58.060484  230.250000
     9     60.802778  242.770833
     10    48.782486  232.066384
     11    29.260446  183.363510
     12    17.850404  148.878706

In [140]:
df_year_month["total"] = df_year_month["casual"] + df_year_month["registered"]

In [142]:
df_year_month

              casual  registered       total
year mnth
2011 1      4.466570   51.040698   55.507267
     2      9.617874   64.673344   74.291217
     3     17.569863   70.163014   87.732877
     4     31.079277  100.867872  131.947149
     5     41.733871  140.821237  182.555108
     6     42.516667  156.805556  199.322222
     7     48.994624  140.979839  189.974462
     8     39.455540  147.536252  186.991792
     9     37.022315  140.687587  177.709902
     10    33.946164  132.286676  166.232840
     11    21.688456  120.407510  142.095967
     12    11.400810  106.443995  117.844804
2012 1     12.103914  118.454791  130.558704
     2     12.602601  136.439306  149.041908
     3     42.554509  179.349933  221.904441
     4     53.559889  189.091922  242.651811
     5     59.455645  203.803763  263.259409
     6     60.130556  221.577778  281.708333
     7     56.055108  217.610215  273.665323
     8     58.060484  230.250000  288.310484
     9     60.802778  242.770833  303.573611
     10    48.782486  232.066384  280.848870
     11    29.260446  183.363510  212.623955
     12    17.850404  148.878706  166.729111

# Step 4 - Writing data frames to CSV file

Lets utilise the pandas function to write back the data frame to CSV file.

In [144]:
df_seasons.head()

        casual  registered    total
season
1        60622      410726   471348
2       203522      715067   918589
3       226091      835038  1061129
4       129782      711831   841613

In [146]:
df_seasons.to_csv("file1.csv")

In [148]:
df_year_month.head()

              casual  registered       total
year mnth
2011 1      4.466570   51.040698   55.507267
     2      9.617874   64.673344   74.291217
     3     17.569863   70.163014   87.732877
     4     31.079277  100.867872  131.947149
     5     41.733871  140.821237  182.555108

In [150]:
df_year_month.to_csv("file2.csv")